/* 
******************************************************************************************************************************
*                                        包含的头文件
******************************************************************************************************************************
*/
#include <rtthread.h>
#include <rthw.h>


/*
******************************************************************************************************************************
*                                         全局变量
******************************************************************************************************************************
*/
/* 线程控制块指针，用于指向当前线程 */
struct rt_thread *rt_current_thread;

/* 线程就绪列表 */
rt_list_t rt_thread_priority_table[RT_THREAD_PRIORITY_MAX];

/* 线程休眠列表 */
rt_list_t rt_thread_defunct;


/*
******************************************************************************************************************************
*                                         函数实现
******************************************************************************************************************************
*/

/* 初始化系统调度器 */
void rt_system_scheduler_init(void)
{
	register rt_base_t offset;
	
	/* 线程就绪列表初始化 */
	for(offset = 0; offset < RT_THREAD_PRIORITY_MAX; offset ++)
	{
			rt_list_init(&rt_thread_priority_table[offset]);
	}
	
	/* 初始化当前线程控制块指针 */
	rt_current_thread = RT_NULL;
	
	/* 初始化线程休眠列表，当线程创建好没有启动之前会被放入到这个列表 */
	rt_list_init(&rt_thread_defunct);
}

/* 启动系统调度器 */
void rt_system_scheduler_start(void)
{
	register struct rt_thread *to_thread;
	
	/* 手动指定第一个运行的线程 */
	to_thread = rt_list_entry(rt_thread_priority_table[0].next,
	                          struct rt_thread,
														tlist);
	rt_current_thread = to_thread;
														
	
}












