#include "header.h"	

uint DisplayChoice;	 //用于决定当前要显示的数值

/*******************************************************************************
* 函 数 名         : keypros()
* 函数功能		   : 按键处理函数，选择要显示的数据
*******************************************************************************/
void keypros()
{
	if(k1 == 0)		   //检测按键K1是否按下
	{	
		delay(1000);   //消除抖动 一般大约10ms														 
		if(k1 == 0)	   //再次判断按键是否按下
		{
			DisplayChoice = 1;
		}
		while(!k1);	   //检测按键是否松开
	}	
	
	if(k2 == 0)		   //检测按键K2是否按下
	{	
		delay(1000);   //消除抖动 一般大约10ms
		if(k2 == 0)	   //再次判断按键是否按下
		{
			DisplayChoice = 2;
			thresholdvalue = 0;	  //如果按下k2则将温度阈值置零，温度阈值段码不变
		}
		while(!k1);	   //检测按键是否松开
	}	
	
	if(k3 == 0)		   //检测按键K3是否按下
	{	
		delay(1000);   //消除抖动 一般大约10ms
		if(k3 == 0)	   //再次判断按键是否按下
		{
			DisplayChoice = 3;
			speedvalue = 0;		 //如果按下k3则将速度设定值置零，速度设定值段码不变
		}
		while(!k1);	   //检测按键是否松开
	}
}

